; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=324, out_folder=./training, instance_id=68, seed=2092, goal_proportion=0.03

(define (problem blocksworld-68)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 - object)
 (:init 
    (arm-empty)
    (clear b200)
    (on b200 b97)
    (on b97 b23)
    (on b23 b76)
    (on-table b76)
    (clear b225)
    (on b225 b283)
    (on b283 b152)
    (on b152 b90)
    (on b90 b273)
    (on b273 b124)
    (on b124 b121)
    (on b121 b69)
    (on b69 b233)
    (on-table b233)
    (clear b174)
    (on-table b174)
    (clear b140)
    (on-table b140)
    (clear b243)
    (on b243 b168)
    (on b168 b131)
    (on-table b131)
    (clear b78)
    (on-table b78)
    (clear b178)
    (on b178 b250)
    (on-table b250)
    (clear b247)
    (on-table b247)
    (clear b161)
    (on-table b161)
    (clear b50)
    (on-table b50)
    (clear b197)
    (on b197 b238)
    (on b238 b93)
    (on b93 b222)
    (on b222 b19)
    (on-table b19)
    (clear b276)
    (on b276 b291)
    (on-table b291)
    (clear b138)
    (on b138 b217)
    (on b217 b117)
    (on b117 b323)
    (on b323 b82)
    (on-table b82)
    (clear b12)
    (on-table b12)
    (clear b271)
    (on-table b271)
    (clear b232)
    (on b232 b218)
    (on b218 b300)
    (on b300 b193)
    (on b193 b170)
    (on b170 b162)
    (on-table b162)
    (clear b185)
    (on b185 b226)
    (on b226 b75)
    (on b75 b236)
    (on-table b236)
    (clear b141)
    (on b141 b207)
    (on b207 b175)
    (on b175 b266)
    (on b266 b248)
    (on b248 b275)
    (on b275 b86)
    (on b86 b104)
    (on b104 b257)
    (on b257 b195)
    (on b195 b46)
    (on b46 b4)
    (on b4 b127)
    (on b127 b260)
    (on b260 b122)
    (on b122 b155)
    (on b155 b173)
    (on-table b173)
    (clear b180)
    (on b180 b322)
    (on b322 b150)
    (on b150 b70)
    (on b70 b33)
    (on b33 b42)
    (on b42 b187)
    (on-table b187)
    (clear b292)
    (on b292 b270)
    (on b270 b318)
    (on b318 b142)
    (on b142 b277)
    (on b277 b144)
    (on b144 b149)
    (on b149 b285)
    (on-table b285)
    (clear b6)
    (on b6 b40)
    (on-table b40)
    (clear b196)
    (on b196 b83)
    (on-table b83)
    (clear b18)
    (on b18 b30)
    (on b30 b159)
    (on b159 b114)
    (on-table b114)
    (clear b279)
    (on b279 b249)
    (on b249 b181)
    (on-table b181)
    (clear b316)
    (on-table b316)
    (clear b111)
    (on-table b111)
    (clear b125)
    (on b125 b216)
    (on b216 b179)
    (on b179 b67)
    (on b67 b221)
    (on b221 b88)
    (on b88 b15)
    (on b15 b60)
    (on b60 b137)
    (on b137 b106)
    (on b106 b205)
    (on b205 b192)
    (on b192 b210)
    (on b210 b118)
    (on b118 b17)
    (on b17 b310)
    (on b310 b244)
    (on b244 b37)
    (on b37 b5)
    (on-table b5)
    (clear b68)
    (on b68 b239)
    (on b239 b22)
    (on b22 b13)
    (on-table b13)
    (clear b296)
    (on b296 b286)
    (on b286 b227)
    (on b227 b9)
    (on-table b9)
    (clear b109)
    (on b109 b101)
    (on b101 b129)
    (on-table b129)
    (clear b139)
    (on b139 b254)
    (on b254 b261)
    (on b261 b63)
    (on b63 b198)
    (on b198 b130)
    (on b130 b48)
    (on b48 b38)
    (on-table b38)
    (clear b154)
    (on b154 b116)
    (on b116 b65)
    (on-table b65)
    (clear b242)
    (on b242 b202)
    (on b202 b55)
    (on b55 b25)
    (on-table b25)
    (clear b299)
    (on-table b299)
    (clear b324)
    (on b324 b136)
    (on-table b136)
    (clear b87)
    (on-table b87)
    (clear b190)
    (on-table b190)
    (clear b315)
    (on b315 b295)
    (on b295 b314)
    (on b314 b36)
    (on-table b36)
    (clear b11)
    (on b11 b189)
    (on b189 b115)
    (on b115 b287)
    (on b287 b77)
    (on b77 b212)
    (on-table b212)
    (clear b16)
    (on b16 b263)
    (on b263 b201)
    (on b201 b43)
    (on b43 b253)
    (on-table b253)
    (clear b214)
    (on-table b214)
    (clear b64)
    (on-table b64)
    (clear b157)
    (on b157 b145)
    (on-table b145)
    (clear b91)
    (on-table b91)
    (clear b282)
    (on b282 b160)
    (on-table b160)
    (clear b123)
    (on b123 b94)
    (on b94 b20)
    (on-table b20)
    (clear b113)
    (on b113 b231)
    (on-table b231)
    (clear b211)
    (on b211 b182)
    (on b182 b89)
    (on b89 b281)
    (on b281 b79)
    (on b79 b267)
    (on b267 b102)
    (on-table b102)
    (clear b321)
    (on b321 b164)
    (on b164 b288)
    (on b288 b66)
    (on b66 b224)
    (on b224 b209)
    (on-table b209)
    (clear b51)
    (on-table b51)
    (clear b215)
    (on b215 b73)
    (on b73 b98)
    (on-table b98)
    (clear b146)
    (on b146 b105)
    (on b105 b169)
    (on-table b169)
    (clear b72)
    (on b72 b171)
    (on b171 b165)
    (on b165 b191)
    (on-table b191)
    (clear b220)
    (on b220 b56)
    (on-table b56)
    (clear b272)
    (on b272 b183)
    (on b183 b252)
    (on-table b252)
    (clear b204)
    (on b204 b80)
    (on b80 b35)
    (on-table b35)
    (clear b134)
    (on-table b134)
    (clear b188)
    (on-table b188)
    (clear b306)
    (on b306 b21)
    (on-table b21)
    (clear b14)
    (on b14 b2)
    (on b2 b269)
    (on b269 b95)
    (on b95 b259)
    (on-table b259)
    (clear b163)
    (on-table b163)
    (clear b280)
    (on-table b280)
    (clear b308)
    (on b308 b251)
    (on-table b251)
    (clear b156)
    (on b156 b289)
    (on-table b289)
    (clear b304)
    (on b304 b311)
    (on b311 b126)
    (on b126 b103)
    (on b103 b319)
    (on b319 b34)
    (on b34 b290)
    (on b290 b100)
    (on-table b100)
    (clear b305)
    (on b305 b264)
    (on b264 b176)
    (on b176 b31)
    (on b31 b213)
    (on-table b213)
    (clear b58)
    (on-table b58)
    (clear b158)
    (on b158 b234)
    (on-table b234)
    (clear b303)
    (on-table b303)
    (clear b246)
    (on b246 b241)
    (on b241 b148)
    (on-table b148)
    (clear b301)
    (on b301 b265)
    (on-table b265)
    (clear b10)
    (on b10 b61)
    (on-table b61)
    (clear b3)
    (on b3 b133)
    (on-table b133)
    (clear b147)
    (on b147 b28)
    (on b28 b26)
    (on b26 b8)
    (on b8 b240)
    (on b240 b293)
    (on-table b293)
    (clear b294)
    (on b294 b7)
    (on b7 b99)
    (on b99 b92)
    (on b92 b62)
    (on b62 b120)
    (on b120 b229)
    (on b229 b128)
    (on b128 b108)
    (on b108 b49)
    (on b49 b85)
    (on-table b85)
    (clear b54)
    (on b54 b237)
    (on-table b237)
    (clear b119)
    (on-table b119)
    (clear b44)
    (on b44 b71)
    (on b71 b298)
    (on-table b298)
    (clear b274)
    (on b274 b302)
    (on b302 b186)
    (on-table b186)
    (clear b245)
    (on b245 b29)
    (on-table b29)
    (clear b208)
    (on-table b208)
    (clear b206)
    (on b206 b309)
    (on-table b309)
    (clear b262)
    (on b262 b27)
    (on b27 b96)
    (on b96 b312)
    (on b312 b47)
    (on-table b47)
    (clear b107)
    (on-table b107)
    (clear b1)
    (on-table b1)
    (clear b39)
    (on b39 b228)
    (on b228 b297)
    (on b297 b32)
    (on b32 b230)
    (on b230 b53)
    (on b53 b172)
    (on b172 b284)
    (on b284 b143)
    (on b143 b256)
    (on-table b256)
    (clear b59)
    (on b59 b135)
    (on b135 b132)
    (on b132 b313)
    (on b313 b151)
    (on b151 b268)
    (on b268 b24)
    (on-table b24)
    (clear b307)
    (on b307 b45)
    (on b45 b235)
    (on-table b235)
    (clear b223)
    (on b223 b153)
    (on b153 b84)
    (on-table b84)
    (clear b166)
    (on b166 b177)
    (on b177 b57)
    (on-table b57)
    (clear b74)
    (on b74 b203)
    (on-table b203)
    (clear b255)
    (on-table b255)
    (clear b81)
    (on-table b81)
    (clear b278)
    (on-table b278)
    (clear b41)
    (on-table b41)
    (clear b320)
    (on b320 b317)
    (on b317 b52)
    (on-table b52)
    (clear b194)
    (on-table b194)
    (clear b112)
    (on b112 b167)
    (on-table b167)
    (clear b258)
    (on-table b258)
    (clear b184)
    (on-table b184)
    (clear b110)
    (on-table b110)
    (clear b199)
    (on b199 b219)
    (on-table b219))
 (:goal  (and 
    (clear b3)
    (on-table b3)
    (clear b4)
    (on b4 b9)
    (on b9 b7)
    (on b7 b2)
    (on b2 b8)
    (on b8 b6)
    (on b6 b1)
    (on-table b1)
    (clear b5)
    (on-table b5))))

; plan
1. (unstack b3 b133)
   deleted: (on b3 b133) (clear b3) (arm-empty)
   added: (holding b3) (clear b133)
   goals met: 2 of 12
2. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 4 of 12
3. (unstack b125 b216)
   deleted: (on b125 b216) (clear b125) (arm-empty)
   added: (holding b125) (clear b216)
   goals met: 4 of 12
4. (putdown b125)
   deleted: (holding b125)
   added: (clear b125) (arm-empty) (on-table b125)
   goals met: 4 of 12
5. (unstack b14 b2)
   deleted: (on b14 b2) (clear b14) (arm-empty)
   added: (holding b14) (clear b2)
   goals met: 4 of 12
6. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 4 of 12
7. (unstack b141 b207)
   deleted: (on b141 b207) (clear b141) (arm-empty)
   added: (holding b141) (clear b207)
   goals met: 4 of 12
8. (putdown b141)
   deleted: (holding b141)
   added: (clear b141) (arm-empty) (on-table b141)
   goals met: 4 of 12
9. (unstack b147 b28)
   deleted: (on b147 b28) (clear b147) (arm-empty)
   added: (holding b147) (clear b28)
   goals met: 4 of 12
10. (putdown b147)
   deleted: (holding b147)
   added: (clear b147) (arm-empty) (on-table b147)
   goals met: 4 of 12
11. (unstack b207 b175)
   deleted: (on b207 b175) (clear b207) (arm-empty)
   added: (holding b207) (clear b175)
   goals met: 4 of 12
12. (putdown b207)
   deleted: (holding b207)
   added: (clear b207) (arm-empty) (on-table b207)
   goals met: 4 of 12
13. (unstack b175 b266)
   deleted: (on b175 b266) (clear b175) (arm-empty)
   added: (holding b175) (clear b266)
   goals met: 4 of 12
14. (putdown b175)
   deleted: (holding b175)
   added: (clear b175) (arm-empty) (on-table b175)
   goals met: 4 of 12
15. (unstack b216 b179)
   deleted: (on b216 b179) (clear b216) (arm-empty)
   added: (holding b216) (clear b179)
   goals met: 4 of 12
16. (putdown b216)
   deleted: (holding b216)
   added: (clear b216) (arm-empty) (on-table b216)
   goals met: 4 of 12
17. (unstack b179 b67)
   deleted: (on b179 b67) (clear b179) (arm-empty)
   added: (holding b179) (clear b67)
   goals met: 4 of 12
18. (putdown b179)
   deleted: (holding b179)
   added: (clear b179) (arm-empty) (on-table b179)
   goals met: 4 of 12
19. (unstack b266 b248)
   deleted: (on b266 b248) (clear b266) (arm-empty)
   added: (holding b266) (clear b248)
   goals met: 4 of 12
20. (putdown b266)
   deleted: (holding b266)
   added: (clear b266) (arm-empty) (on-table b266)
   goals met: 4 of 12
21. (unstack b248 b275)
   deleted: (on b248 b275) (clear b248) (arm-empty)
   added: (holding b248) (clear b275)
   goals met: 4 of 12
22. (putdown b248)
   deleted: (holding b248)
   added: (clear b248) (arm-empty) (on-table b248)
   goals met: 4 of 12
23. (unstack b275 b86)
   deleted: (on b275 b86) (clear b275) (arm-empty)
   added: (holding b275) (clear b86)
   goals met: 4 of 12
24. (putdown b275)
   deleted: (holding b275)
   added: (clear b275) (arm-empty) (on-table b275)
   goals met: 4 of 12
25. (unstack b28 b26)
   deleted: (on b28 b26) (clear b28) (arm-empty)
   added: (holding b28) (clear b26)
   goals met: 4 of 12
26. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 4 of 12
27. (unstack b26 b8)
   deleted: (on b26 b8) (clear b26) (arm-empty)
   added: (holding b26) (clear b8)
   goals met: 4 of 12
28. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 4 of 12
29. (unstack b294 b7)
   deleted: (on b294 b7) (clear b294) (arm-empty)
   added: (holding b294) (clear b7)
   goals met: 4 of 12
30. (putdown b294)
   deleted: (holding b294)
   added: (clear b294) (arm-empty) (on-table b294)
   goals met: 4 of 12
31. (unstack b296 b286)
   deleted: (on b296 b286) (clear b296) (arm-empty)
   added: (holding b296) (clear b286)
   goals met: 4 of 12
32. (putdown b296)
   deleted: (holding b296)
   added: (clear b296) (arm-empty) (on-table b296)
   goals met: 4 of 12
33. (unstack b286 b227)
   deleted: (on b286 b227) (clear b286) (arm-empty)
   added: (holding b286) (clear b227)
   goals met: 4 of 12
34. (putdown b286)
   deleted: (holding b286)
   added: (clear b286) (arm-empty) (on-table b286)
   goals met: 4 of 12
35. (unstack b227 b9)
   deleted: (on b227 b9) (clear b227) (arm-empty)
   added: (holding b227) (clear b9)
   goals met: 4 of 12
36. (putdown b227)
   deleted: (holding b227)
   added: (clear b227) (arm-empty) (on-table b227)
   goals met: 4 of 12
37. (unstack b67 b221)
   deleted: (on b67 b221) (clear b67) (arm-empty)
   added: (holding b67) (clear b221)
   goals met: 4 of 12
38. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 4 of 12
39. (unstack b221 b88)
   deleted: (on b221 b88) (clear b221) (arm-empty)
   added: (holding b221) (clear b88)
   goals met: 4 of 12
40. (putdown b221)
   deleted: (holding b221)
   added: (clear b221) (arm-empty) (on-table b221)
   goals met: 4 of 12
41. (unstack b86 b104)
   deleted: (on b86 b104) (clear b86) (arm-empty)
   added: (holding b86) (clear b104)
   goals met: 4 of 12
42. (putdown b86)
   deleted: (holding b86)
   added: (clear b86) (arm-empty) (on-table b86)
   goals met: 4 of 12
43. (unstack b104 b257)
   deleted: (on b104 b257) (clear b104) (arm-empty)
   added: (holding b104) (clear b257)
   goals met: 4 of 12
44. (putdown b104)
   deleted: (holding b104)
   added: (clear b104) (arm-empty) (on-table b104)
   goals met: 4 of 12
45. (unstack b257 b195)
   deleted: (on b257 b195) (clear b257) (arm-empty)
   added: (holding b257) (clear b195)
   goals met: 4 of 12
46. (putdown b257)
   deleted: (holding b257)
   added: (clear b257) (arm-empty) (on-table b257)
   goals met: 4 of 12
47. (unstack b195 b46)
   deleted: (on b195 b46) (clear b195) (arm-empty)
   added: (holding b195) (clear b46)
   goals met: 4 of 12
48. (putdown b195)
   deleted: (holding b195)
   added: (clear b195) (arm-empty) (on-table b195)
   goals met: 4 of 12
49. (unstack b46 b4)
   deleted: (on b46 b4) (clear b46) (arm-empty)
   added: (holding b46) (clear b4)
   goals met: 5 of 12
50. (putdown b46)
   deleted: (holding b46)
   added: (clear b46) (arm-empty) (on-table b46)
   goals met: 5 of 12
51. (unstack b88 b15)
   deleted: (on b88 b15) (clear b88) (arm-empty)
   added: (holding b88) (clear b15)
   goals met: 5 of 12
52. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 5 of 12
53. (unstack b15 b60)
   deleted: (on b15 b60) (clear b15) (arm-empty)
   added: (holding b15) (clear b60)
   goals met: 5 of 12
54. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 5 of 12
55. (unstack b60 b137)
   deleted: (on b60 b137) (clear b60) (arm-empty)
   added: (holding b60) (clear b137)
   goals met: 5 of 12
56. (putdown b60)
   deleted: (holding b60)
   added: (clear b60) (arm-empty) (on-table b60)
   goals met: 5 of 12
57. (unstack b137 b106)
   deleted: (on b137 b106) (clear b137) (arm-empty)
   added: (holding b137) (clear b106)
   goals met: 5 of 12
58. (putdown b137)
   deleted: (holding b137)
   added: (clear b137) (arm-empty) (on-table b137)
   goals met: 5 of 12
59. (unstack b106 b205)
   deleted: (on b106 b205) (clear b106) (arm-empty)
   added: (holding b106) (clear b205)
   goals met: 5 of 12
60. (putdown b106)
   deleted: (holding b106)
   added: (clear b106) (arm-empty) (on-table b106)
   goals met: 5 of 12
61. (unstack b205 b192)
   deleted: (on b205 b192) (clear b205) (arm-empty)
   added: (holding b205) (clear b192)
   goals met: 5 of 12
62. (putdown b205)
   deleted: (holding b205)
   added: (clear b205) (arm-empty) (on-table b205)
   goals met: 5 of 12
63. (unstack b192 b210)
   deleted: (on b192 b210) (clear b192) (arm-empty)
   added: (holding b192) (clear b210)
   goals met: 5 of 12
64. (putdown b192)
   deleted: (holding b192)
   added: (clear b192) (arm-empty) (on-table b192)
   goals met: 5 of 12
65. (unstack b210 b118)
   deleted: (on b210 b118) (clear b210) (arm-empty)
   added: (holding b210) (clear b118)
   goals met: 5 of 12
66. (putdown b210)
   deleted: (holding b210)
   added: (clear b210) (arm-empty) (on-table b210)
   goals met: 5 of 12
67. (unstack b118 b17)
   deleted: (on b118 b17) (clear b118) (arm-empty)
   added: (holding b118) (clear b17)
   goals met: 5 of 12
68. (putdown b118)
   deleted: (holding b118)
   added: (clear b118) (arm-empty) (on-table b118)
   goals met: 5 of 12
69. (unstack b17 b310)
   deleted: (on b17 b310) (clear b17) (arm-empty)
   added: (holding b17) (clear b310)
   goals met: 5 of 12
70. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 5 of 12
71. (unstack b310 b244)
   deleted: (on b310 b244) (clear b310) (arm-empty)
   added: (holding b310) (clear b244)
   goals met: 5 of 12
72. (putdown b310)
   deleted: (holding b310)
   added: (clear b310) (arm-empty) (on-table b310)
   goals met: 5 of 12
73. (unstack b244 b37)
   deleted: (on b244 b37) (clear b244) (arm-empty)
   added: (holding b244) (clear b37)
   goals met: 5 of 12
74. (putdown b244)
   deleted: (holding b244)
   added: (clear b244) (arm-empty) (on-table b244)
   goals met: 5 of 12
75. (unstack b37 b5)
   deleted: (on b37 b5) (clear b37) (arm-empty)
   added: (holding b37) (clear b5)
   goals met: 6 of 12
76. (putdown b37)
   deleted: (holding b37)
   added: (clear b37) (arm-empty) (on-table b37)
   goals met: 6 of 12
77. (unstack b2 b269)
   deleted: (on b2 b269) (clear b2) (arm-empty)
   added: (holding b2) (clear b269)
   goals met: 6 of 12
78. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 7 of 12
79. (unstack b6 b40)
   deleted: (on b6 b40) (clear b6) (arm-empty)
   added: (holding b6) (clear b40)
   goals met: 7 of 12
80. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 8 of 12
81. (unstack b7 b99)
   deleted: (on b7 b99) (clear b7) (arm-empty)
   added: (holding b7) (clear b99)
   goals met: 8 of 12
82. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 9 of 12
83. (unstack b4 b127)
   deleted: (on b4 b127) (clear b4) (arm-empty)
   added: (holding b4) (clear b127)
   goals met: 8 of 12
84. (stack b4 b9)
   deleted: (clear b9) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b9)
   goals met: 10 of 12
85. (unstack b7 b2)
   deleted: (on b7 b2) (clear b7) (arm-empty)
   added: (holding b7) (clear b2)
   goals met: 9 of 12
86. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 9 of 12
87. (unstack b2 b8)
   deleted: (on b2 b8) (clear b2) (arm-empty)
   added: (holding b2) (clear b8)
   goals met: 8 of 12
88. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 8 of 12
89. (unstack b8 b240)
   deleted: (on b8 b240) (clear b8) (arm-empty)
   added: (holding b8) (clear b240)
   goals met: 8 of 12
90. (stack b8 b6)
   deleted: (clear b6) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b6)
   goals met: 9 of 12
91. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 9 of 12
92. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 10 of 12
93. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 10 of 12
94. (stack b7 b2)
   deleted: (clear b2) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b2)
   goals met: 11 of 12
95. (unstack b4 b9)
   deleted: (on b4 b9) (clear b4) (arm-empty)
   added: (holding b4) (clear b9)
   goals met: 9 of 12
96. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 10 of 12
97. (pickup b9)
   deleted: (clear b9) (on-table b9) (arm-empty)
   added: (holding b9)
   goals met: 10 of 12
98. (stack b9 b7)
   deleted: (clear b7) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b7)
   goals met: 11 of 12
99. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 10 of 12
100. (stack b4 b9)
   deleted: (clear b9) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b9)
   goals met: 12 of 12
